In [1]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt

In [2]:
df_master = pd.read_csv('train.csv')

In [3]:
df_master = df_master.drop(['Fare','Ticket','Embarked'],axis=1)

In [4]:
df_master['Cabin'] =

SyntaxError: invalid syntax (<ipython-input-4-55fcd67d4550>, line 1)

In [5]:
df_master

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Cabin
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,NaN
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,C85
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,NaN
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,C123
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,NaN
...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,NaN
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,B42
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,NaN
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,C148
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,NaN